Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz2064dar176.h
extern volatile __I2C3MSKbits_t I2C3MSKbits __asm__ ("I2C3MSK") __attribute__((section("sfrs"), address(0xBF820430)));
extern volatile uint32_t        I2C3MSKCLR __attribute__((section("sfrs"),address(0xBF820434)));
extern volatile uint32_t        I2C3MSKSET __attribute__((section("sfrs"),address(0xBF820438)));
extern volatile uint32_t        I2C3MSKINV __attribute__((section("sfrs"),address(0xBF82043C)));
#define I2C3BRG I2C3BRG
extern volatile uint32_t   I2C3BRG __attribute__((section("sfrs"), address(0xBF820440)));
typedef struct {
  uint32_t I2CBRG:16;
} __I2C3BRGbits_t;
extern volatile __I2C3BRGbits_t I2C3BRGbits __asm__ ("I2C3BRG") __attribute__((section("sfrs"), address(0xBF820440)));
extern volatile uint32_t        I2C3BRGCLR __attribute__((section("sfrs"),address(0xBF820444)));
extern volatile uint32_t        I2C3BRGSET __attribute__((section("sfrs"),address(0xBF820448)));
extern volatile uint32_t        I2C3BRGINV __attribute__((section("sfrs"),address(0xBF82044C)));
#define I2C3TRN I2C3TRN
extern volatile uint32_t   I2C3TRN __attribute__((section("sfrs"), address(0xBF820450)));
typedef struct {
  uint32_t I2CTRN:8;
} __I2C3TRNbits_t;
extern volatile __I2C3TRNbits_t I2C3TRNbits __asm__ ("I2C3TRN") __attribute__((section("sfrs"), address(0xBF820450)));
extern volatile uint32_t        I2C3TRNCLR __attribute__((section("sfrs"),address(0xBF820454)));
extern volatile uint32_t        I2C3TRNSET __attribute__((section("sfrs"),address(0xBF820458)));
extern volatile uint32_t        I2C3TRNINV __attribute__((section("sfrs"),address(0xBF82045C)));
#define I2C3RCV I2C3RCV
extern volatile uint32_t   I2C3RCV __attribute__((section("sfrs"), address(0xBF820460)));
typedef struct {
  uint32_t I2CRCV:8;
} __I2C3RCVbits_t;
extern volatile __I2C3RCVbits_t I2C3RCVbits __asm__ ("I2C3RCV") __attribute__((section("sfrs"), address(0xBF820460)));
extern volatile uint32_t        I2C3RCVCLR __attribute__((section("sfrs"),address(0xBF820464)));
extern volatile uint32_t        I2C3RCVSET __attribute__((section("sfrs"),address(0xBF820468)));
extern volatile uint32_t        I2C3RCVINV __attribute__((section("sfrs"),address(0xBF82046C)));
#define I2C4CON I2C4CON
extern volatile uint32_t   I2C4CON __attribute__((section("sfrs"), address(0xBF820600)));
typedef union {
  struct {
    uint32_t SEN:1;
    uint32_t RSEN:1;
    uint32_t PEN:1;
    uint32_t RCEN:1;
    uint32_t ACKEN:1;
    uint32_t ACKDT:1;
    uint32_t STREN:1;
    uint32_t GCEN:1;
    uint32_t SMEN:1;
    uint32_t DISSLW:1;
    uint32_t A10M:1;
    uint32_t STRICT:1;
    uint32_t SCLREL:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t DHEN:1;
    uint32_t AHEN:1;
    uint32_t SBCDE:1;
    uint32_t SDAHT:1;
    uint32_t BOEN:1;
    uint32_t SCIE:1;
    uint32_t PCIE:1;
  };
  struct {
    uint32_t :11;
    uint32_t IPMIEN:1;
    uint32_t :1;
    uint32_t I2CSIDL:1;
    uint32_t :1;
    uint32_t I2CEN:1;
  };
} __I2C4CONbits_t;
extern volatile __I2C4CONbits_t I2C4CONbits __asm__ ("I2C4CON") __attribute__((section("sfrs"), address(0xBF820600)));
extern volatile uint32_t        I2C4CONCLR __attribute__((section("sfrs"),address(0xBF820604)));
extern volatile uint32_t        I2C4CONSET __attribute__((section("sfrs"),address(0xBF820608)));
extern volatile uint32_t        I2C4CONINV __attribute__((section("sfrs"),address(0xBF82060C)));
#define I2C4STAT I2C4STAT
extern volatile uint32_t   I2C4STAT __attribute__((section("sfrs"), address(0xBF820610)));
typedef union {
  struct {
    uint32_t TBF:1;
    uint32_t RBF:1;
    uint32_t R_W:1;
    uint32_t S:1;
    uint32_t P:1;
    uint32_t D_A:1;
    uint32_t I2COV:1;
    uint32_t IWCOL:1;
    uint32_t ADD10:1;
    uint32_t GCSTAT:1;
    uint32_t BCL:1;
    uint32_t :2;
    uint32_t ACKTIM:1;
    uint32_t TRSTAT:1;
    uint32_t ACKSTAT:1;
  };
  struct {
    uint32_t :6;
    uint32_t I2CPOV:1;
  };
} __I2C4STATbits_t;
extern volatile __I2C4STATbits_t I2C4STATbits __asm__ ("I2C4STAT") __attribute__((section("sfrs"), address(0xBF820610)));
extern volatile uint32_t        I2C4STATCLR __attribute__((section("sfrs"),address(0xBF820614)));
extern volatile uint32_t        I2C4STATSET __attribute__((section("sfrs"),address(0xBF820618)));
extern volatile uint32_t        I2C4STATINV __attribute__((section("sfrs"),address(0xBF82061C)));
#define I2C4ADD I2C4ADD
extern volatile uint32_t   I2C4ADD __attribute__((section("sfrs"), address(0xBF820620)));
typedef struct {
  uint32_t I2CADD:10;
} __I2C4ADDbits_t;
extern volatile __I2C4ADDbits_t I2C4ADDbits __asm__ ("I2C4ADD") __attribute__((section("sfrs"), address(0xBF820620)));
extern volatile uint32_t        I2C4ADDCLR __attribute__((section("sfrs"),address(0xBF820624)));
extern volatile uint32_t        I2C4ADDSET __attribute__((section("sfrs"),address(0xBF820628)));
extern volatile uint32_t        I2C4ADDINV __attribute__((section("sfrs"),address(0xBF82062C)));
#define I2C4MSK I2C4MSK
extern volatile uint32_t   I2C4MSK __attribute__((section("sfrs"), address(0xBF820630)));
typedef union {
  struct {
    uint32_t I2CMSK:10;
  };
  struct {
    uint32_t AMSK:10;
  };
} __I2C4MSKbits_t;
extern volatile __I2C4MSKbits_t I2C4MSKbits __asm__ ("I2C4MSK") __attribute__((section("sfrs"), address(0xBF820630)));
extern volatile uint32_t        I2C4MSKCLR __attribute__((section("sfrs"),address(0xBF820634)));
extern volatile uint32_t        I2C4MSKSET __attribute__((section("sfrs"),address(0xBF820638)));
extern volatile uint32_t        I2C4MSKINV __attribute__((section("sfrs"),address(0xBF82063C)));
#define I2C4BRG I2C4BRG
extern volatile uint32_t   I2C4BRG __attribute__((section("sfrs"), address(0xBF820640)));
typedef struct {
  uint32_t I2CBRG:16;
} __I2C4BRGbits_t;
extern volatile __I2C4BRGbits_t I2C4BRGbits __asm__ ("I2C4BRG") __attribute__((section("sfrs"), address(0xBF820640)));
extern volatile uint32_t        I2C4BRGCLR __attribute__((section("sfrs"),address(0xBF820644)));
extern volatile uint32_t        I2C4BRGSET __attribute__((section("sfrs"),address(0xBF820648)));
extern volatile uint32_t        I2C4BRGINV __attribute__((section("sfrs"),address(0xBF82064C)));
#define I2C4TRN I2C4TRN
extern volatile uint32_t   I2C4TRN __attribute__((section("sfrs"), address(0xBF820650)));
typedef struct {
  uint32_t I2CTRN:8;
} __I2C4TRNbits_t;
extern volatile __I2C4TRNbits_t I2C4TRNbits __asm__ ("I2C4TRN") __attribute__((section("sfrs"), address(0xBF820650)));
extern volatile uint32_t        I2C4TRNCLR __attribute__((section("sfrs"),address(0xBF820654)));
extern volatile uint32_t        I2C4TRNSET __attribute__((section("sfrs"),address(0xBF820658)));
extern volatile uint32_t        I2C4TRNINV __attribute__((section("sfrs"),address(0xBF82065C)));
#define I2C4RCV I2C4RCV
extern volatile uint32_t   I2C4RCV __attribute__((section("sfrs"), address(0xBF820660)));
typedef struct {
  uint32_t I2CRCV:8;
} __I2C4RCVbits_t;
